Revit 2024 API
BuiltInFailures.DisplacementElementFailures.ElementsAlreadyDisplacedInView Property
 You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementsAlreadyDisplacedInView { get; }
Visual Basic
Public Shared ReadOnly Property ElementsAlreadyDisplacedInView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementsAlreadyDisplacedInView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DisplacementElementFailures Class
Autodesk.Revit.DB Namespace